In [2]:
# import pandas as pd
# # merge , join and concatenate in pandas
# data1 = {"emp id": ["E01", "E02", "E03", "E04", "E05", "E06"],
#          "names": ["ram", "shyam", "rahul", "cishal", "ravi", "john"],
#          "age": [34, 56, 23, 44, 32,59]}



# data2 = {"emp id": ["E01", "E07", "E03", "E04", "E08", "E06"],
#          "salary": [45000, 56000, 34000, 30000, 50000, 62000]}

# df1=pd.DataFrame(data1)
# df2=pd.DataFrame(data2)

# print(df1)
# print()
# print(df2)

  emp id   names  age
0    E01     ram   34
1    E02   shyam   56
2    E03   rahul   23
3    E04  cishal   44
4    E05    ravi   32
5    E06    john   59

  emp id  salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E08   50000
5    E06   62000

In [3]:
print(pd.merge(df1,df2,on="emp id")) # merge takes place with those columns only , which is common to both the df.

  emp id   names  age  salary
0    E01     ram   34   45000
1    E03   rahul   23   34000
2    E04  cishal   44   30000
3    E06    john   59   62000

In [4]:
print(pd.merge(df1,df2,on="emp id",how="inner"))

  emp id   names  age  salary
0    E01     ram   34   45000
1    E03   rahul   23   34000
2    E04  cishal   44   30000
3    E06    john   59   62000

In [5]:
print(pd.merge(df1,df2,on="emp id",how="left")) #---> it means left table ka sara data aa jayega or jo data data right table me h , agar wo match nhi kr rha h left table se to usme NaN aa jayega

  emp id   names  age   salary
0    E01     ram   34  45000.0
1    E02   shyam   56      NaN
2    E03   rahul   23  34000.0
3    E04  cishal   44  30000.0
4    E05    ravi   32      NaN
5    E06    john   59  62000.0

In [10]:
print(pd.merge(df1,df2,on="emp id",how="right"))

  emp id   names   age  salary
0    E01     ram  34.0   45000
1    E07     NaN   NaN   56000
2    E03   rahul  23.0   34000
3    E04  cishal  44.0   30000
4    E08     NaN   NaN   50000
5    E06    john  59.0   62000

In [16]:
# concatenate-- merge two data (put below each other                           )

data1 = {"emp id": ["E01", "E02", "E03", "E04", "E05", "E06"],
         "names": ["ram", "shyam", "rahul", "cishal", "ravi", "john"],
         "age": [34, 56, 23, 44, 32,59]}

data2 = {"emp id": ["E07", "E08", "E09", "E10", "E11", "E12"],
         "names": ["biitu", "chintu", "poppu", "chotu", "bunty", "goli"],
         "age": [34, 56, 23, 44, 32,59]}

df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)

print(pd.concat([df1,df2]))

  emp id   names  age
0    E01     ram   34
1    E02   shyam   56
2    E03   rahul   23
3    E04  cishal   44
4    E05    ravi   32
5    E06    john   59
0    E07   biitu   34
1    E08  chintu   56
2    E09   poppu   23
3    E10   chotu   44
4    E11   bunty   32
5    E12    goli   59

In [22]:
# pandas ,  compare dataframes

import pandas as pd
dict={"fruits":["mangoes","apples","banana","papaya"],
      "price":[100,150,50,35],
     "Quantity": [15,10,10,3]}
df1=pd.DataFrame(dict)
print(df1)

# after one month, price and quantity changes
df2=df1.copy()
df2.loc[0,"price"]=120
df2.loc[1,"price"]=175
df2.loc[3,"price"]=30
df2.loc[0,"Quantity"]=12
df2.loc[1,"Quantity"]=15
df2.loc[3,"Quantity"]=5
print(df2)
print(df1.compare(df2))

print(df1.compare(df2,align_axis=0)) 
# print(df1.compare(df2,keep_shape=True))
print(df1.compare(df2,keep_shape=True))

    fruits  price  Quantity
0  mangoes    100        15
1   apples    150        10
2   banana     50        10
3   papaya     35         3
    fruits  price  Quantity
0  mangoes    120        12
1   apples    175        15
2   banana     50        10
3   papaya     30         5
   price        Quantity
    self  other     self other
0  100.0  120.0     15.0  12.0
1  150.0  175.0     10.0  15.0
3   35.0   30.0      3.0   5.0
         price  Quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
3 self    35.0       3.0
  other   30.0       5.0
  fruits        price        Quantity
    self other   self  other     self other
0    NaN   NaN  100.0  120.0     15.0  12.0
1    NaN   NaN  150.0  175.0     10.0  15.0
2    NaN   NaN    NaN    NaN      NaN   NaN
3    NaN   NaN   35.0   30.0      3.0   5.0